package com.cxyz.car.data.model.impl;

import com.cxyz.car.data.model.IPreviewModel;

public class PreviewModelImpl extends IPreviewModel {
    @Override
    public void loadData(OnLoadListener onLoadListener) {
        onLoadListener.complete(getData());
    }

    private String[] getData() {
        String[] option = new String[]{"国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色",
                "国行/原封/未激活64G黑色", "国行/原封/未激活64G黑色"};
        return option;
    }
}
